In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Sample_dataset.csv")

In [4]:
# Dropping row

df.drop([1, 2, 3], inplace=True)

In [11]:
# Dropping column

df.drop(["Age"], axis=1, inplace=True)

In [12]:
print(df)

   Sr. no. First Name  Last Name Qualification
0        1       Joe    Williams            MCA
4        5      Mansi  Deshpande             CA
5        6      Rocky      Lewis            BCA
6        7      Harry     Harris          B.COM
7        8       Tina     Bailey             BA
8        9       Ansh    Shriwas         M.TECH
9       10    Michael      Davis            MBA

In [13]:
df1 = df.dropna()

In [14]:
df1.reset_index()

   index  Sr. no. First Name  Last Name Qualification
0      0        1       Joe    Williams            MCA
1      4        5      Mansi  Deshpande             CA
2      5        6      Rocky      Lewis            BCA
3      6        7      Harry     Harris          B.COM
4      7        8       Tina     Bailey             BA
5      8        9       Ansh    Shriwas         M.TECH
6      9       10    Michael      Davis            MBA

In [17]:
df1.set_index("Sr. no.")

        First Name  Last Name Qualification
Sr. no.
1             Joe    Williams            MCA
5            Mansi  Deshpande             CA
6            Rocky      Lewis            BCA
7            Harry     Harris          B.COM
8             Tina     Bailey             BA
9             Ansh    Shriwas         M.TECH
10         Michael      Davis            MBA